# PoundForceFeet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..PoundForceFeet Property
UnitTypeId Class See Also
---
Pound force feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PoundForceFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PoundForceFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PoundForceFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace